def main():
    x, y = float(input()), float(input())
    if -10 <= x <= 10 and abs(y) <= (100 - x ** 2) ** 0.5:
        if (0 <= x <= 5 and 0 <= y <= (25 - x ** 2) ** 0.5 or
                -7 <= x <= 5 and x ** 2 + 2 * x - 35 <= y <= 0 or
                -7 <= x <= -4 and 3 * y <= 5 * x + 35 or
                -4 <= x <= 0 and y <= 5):
            print('Опасность! Покиньте зону как можно скорее!')
        else:
            print('Зона безопасна. Продолжайте работу.')
    else:
        print('Вы вышли в море и рискуете быть съеденным акулой!')

if __name__ == "__main__":
    main()